siade/spec/fixtures/payloads/ants/found_personne_morale_siv.xml

<?xml version="1.0" encoding="utf-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Body>
    <siv:rep_consulter_dossier
      xmlns:siv="http://siv.mi.fr/DefinitionsServices/2007-06"
    >
      <siv:control>
        <siv:code_partenaire>131614</siv:code_partenaire>
        <siv:code_miat>QSIV</siv:code_miat>
        <siv:date_envoi>2025-08-08T12:33:50+02:00</siv:date_envoi>
        <siv:type_operation>Consultation Dossier</siv:type_operation>
        <siv:numero_session
          >req_a1a57c6a-d10d-450b-b8a6-8f40320be6df</siv:numero_session
        >
        <siv:code_traitement>0</siv:code_traitement>
        <siv:code_operation>5078257</siv:code_operation>
        <siv:date_reception>2025-08-08T14:33:50+02:00</siv:date_reception>
        <siv:type_fichier_joint>xml</siv:type_fichier_joint>
      </siv:control>
      <siv:reponse>
        <siv:dossier>
          <siv:immatriculation>
            <siv:num_immat>BG-789-YD</siv:num_immat>
            <siv:date_prem_immat>2006-06-16</siv:date_prem_immat>
            <siv:date_att_immat>2011-01-28</siv:date_att_immat>
            <siv:code_type_immat>N</siv:code_type_immat>
            <siv:libelle_type_immat>Normale</siv:libelle_type_immat>
          </siv:immatriculation>
          <siv:vehicule>
            <siv:caracteristiques_techniques>
              <siv:marque_vehicule>LEGRAS</siv:marque_vehicule>
              <siv:tvv>DSLCEBS</siv:tvv>
              <siv:vin>VF9DS340A60240295</siv:vin>
              <siv:code_couleur>09</siv:code_couleur>
              <siv:libelle_couleur>BLANC</siv:libelle_couleur>
              <siv:pt>0</siv:pt>
              <siv:ptac>38000</siv:ptac>
              <siv:ptra>0</siv:ptra>
              <siv:pt_service>0</siv:pt_service>
              <siv:ptav>9220</siv:ptav>
              <siv:genre_national>SREM</siv:genre_national>
              <siv:carrosserie_national>BACHE</siv:carrosserie_national>
              <siv:type_reception>IS</siv:type_reception>
              <siv:cylindree>0</siv:cylindree>
              <siv:puissance_nette_max>0</siv:puissance_nette_max>
              <siv:puissance_cv>0</siv:puissance_cv>
              <siv:puissance_masse>0.00</siv:puissance_masse>
              <siv:places_debout>0</siv:places_debout>
              <siv:niveau_sonore>0</siv:niveau_sonore>
              <siv:vitesse>0</siv:vitesse>
              <siv:co2>0</siv:co2>
            </siv:caracteristiques_techniques>
          </siv:vehicule>
          <siv:personne>
            <siv:nb_cotitulaires>0</siv:nb_cotitulaires>
            <siv:liste_personnes>
              <siv:personne>
                <siv:code_type_personne>TIT</siv:code_type_personne>
                <siv:libelle_type_personne>titulaire</siv:libelle_type_personne>
                <siv:identite_personne>
                  <siv:flag_pers_physique>non</siv:flag_pers_physique>
                  <siv:raison_sociale
                    >ENTREPRISE ANONYME SARL</siv:raison_sociale
                  >
                  <siv:siren>123456789</siv:siren>
                </siv:identite_personne>
                <siv:adresse_personne>
                  <siv:type_voie>QUARTIER</siv:type_voie>
                  <siv:libelle_voie>DE LA PAIX</siv:libelle_voie>
                  <siv:code_postal>75001</siv:code_postal>
                  <siv:libelle_commune>PARIS</siv:libelle_commune>
                </siv:adresse_personne>
              </siv:personne>
            </siv:liste_personnes>
            <siv:acquisition>
              <siv:dca_date_ca>2020-02-25</siv:dca_date_ca>
              <siv:dca_date_enr_ca>2020-02-26</siv:dca_date_enr_ca>
              <siv:dca_code_type_ca>A</siv:dca_code_type_ca>
              <siv:dca_code_type_nd>N</siv:dca_code_type_nd>
              <siv:dca_qualite_acheteur>AUTO</siv:dca_qualite_acheteur>
            </siv:acquisition>
          </siv:personne>
        </siv:dossier>
      </siv:reponse>
    </siv:rep_consulter_dossier>
  </soapenv:Body>
</soapenv:Envelope>
